tutorialsDyM/2DOscillatoryFlowCylinder/initial_1D_profile/1DSedim/constant/granularRheologyProperties
/*
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      granaularRheologyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

granularRheology   on;

granularDilatancy  off;

granularCohesion  off;

alphaMaxG       alphaMaxG [ 0 0 0 0 0 0 0 ] 0.625;

mus             mus  [ 0 0 0 0 0 0 0 ] 0.63;

mu2             mu2  [ 0 0 0 0 0 0 0 ] 1.13;

I0              I0  [ 0 0 0 0 0 0 0 ] 0.64;

Bphi            Bphi [ 0 0 0 0 0 0 0 ] 0.66;

n               n [ 0 0 0 0 0 0 0 ] 2.5;

Dsmall          Dsmall [ 0 0 -1 0 0 0 0 ] 1e-4;

//BulkFactor      BulkFactor [ 0 0 0 0 0 0 0 ] 0e0;

relaxPa         relaxPa [ 0 0 0 0 0 0 0 ] 5e-2;

// FrictionModel   Coulomb;
FrictionModel   MuI;

// PPressureModel  none;
PPressureModel  MuI;

FluidViscosityModel BoyerEtAl;

// ************************************************************************* //
