tutorialsDyM/2DOscillatoryFlowCylinder/initial_1D_profile/1DSedim/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
 (
	alpha1
    	{
		field alpha_a;
		expression "0.57*0.5*(1.0-tanh(500*(pos().y)))";
                condition "(pos().z<10.0)";
                keepPatches 1;
	}
 );

// ************************************************************************* //
